## 🏗️ [OpenTofu plan](https://opentofu.org)

Changes were detected in the OpenTofu plan. Please review the changes below.

<details>
<summary>
<code>make opentofu-plan</code>
</summary>

```tf
module.talos_cluster["hel01"].talos_machine_secrets.secret_bundle: Refreshing state... [id=machine_secrets]
module.talos_cluster["hel01"].talos_machine_configuration_apply.controlplane["antelope.nicklasfrahm.dev"]: Refreshing state... [id=machine_configuration_apply]
module.talos_cluster["hel01"].talos_machine_bootstrap.controlplane["antelope.nicklasfrahm.dev"]: Refreshing state... [id=machine_bootstrap]
module.talos_cluster["hel01"].talos_cluster_kubeconfig.this: Refreshing state... [id=lab01]
helm_release.authz: Refreshing state... [id=authz]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.talos_cluster["hel01"].data.talos_client_configuration.this will be read during apply
  # (config refers to values not yet known)
 <= data "talos_client_configuration" "this" {
      + client_configuration = (known after apply)
      + cluster_name         = "hel01"
      + endpoints            = [
          + "antelope.nicklasfrahm.dev",
        ]
      + id                   = (known after apply)
      + nodes                = [
          + "antelope.nicklasfrahm.dev",
        ]
      + talos_config         = (sensitive value)
    }

  # module.talos_cluster["hel01"].data.talos_machine_configuration.controlplane["antelope.nicklasfrahm.dev"] will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "controlplane" {
      + cluster_endpoint      = "https://antelope.nicklasfrahm.dev:6443"
      + cluster_name          = "hel01"
      + config_patches        = [
          + <<-EOT
                cluster:
                  allowSchedulingOnControlPlanes: true
                  # Enable OIDC authentication.
                  apiServer:
                    extraArgs:
                      oidc-issuer-url: https://nicklasfrahm.eu.auth0.com/
                      oidc-client-id: Xxy6PZe1WmCFcIwNLNw5XXXlxGJ8YWAP
                      oidc-username-claim: email
                  network:
                    # Configure Pod and Service CIDR ranges.
                    podSubnets:
                      - 172.31.0.0/16
                    serviceSubnets:
                      - 172.30.0.0/16
                    # Disable the default CNI.
                    cni:
                      name: none
                  # Disable kube-proxy.
                  proxy:
                    disabled: true
                  # Install Cilium via an umbrella Helm chart and a job.
                  inlineManifests:
                    - name: cilium-install
                      contents: |
                        ---
                        apiVersion: rbac.authorization.k8s.io/v1
                        kind: ClusterRoleBinding
                        metadata:
                          name: cilium-install
                        roleRef:
                          apiGroup: rbac.authorization.k8s.io
                          kind: ClusterRole
                          name: cluster-admin
                        subjects:
                        - kind: ServiceAccount
                          name: cilium-install
                          namespace: kube-system
                        ---
                        apiVersion: v1
                        kind: ServiceAccount
                        metadata:
                          name: cilium-install
                          namespace: kube-system
                        ---
                        apiVersion: batch/v1
                        kind: Job
                        metadata:
                          name: cilium-install
                          namespace: kube-system
                        spec:
                          backoffLimit: 10
                          template:
                            metadata:
                              labels:
                                app: cilium-install
                            spec:
                              restartPolicy: OnFailure
                              tolerations:
                                - operator: Exists
                                - effect: NoSchedule
                                  operator: Exists
                                - effect: NoExecute
                                  operator: Exists
                                - effect: PreferNoSchedule
                                  operator: Exists
                                - key: node-role.kubernetes.io/control-plane
                                  operator: Exists
                                  effect: NoSchedule
                                - key: node-role.kubernetes.io/control-plane
                                  operator: Exists
                                  effect: NoExecute
                                - key: node-role.kubernetes.io/control-plane
                                  operator: Exists
                                  effect: PreferNoSchedule
                              affinity:
                                nodeAffinity:
                                  requiredDuringSchedulingIgnoredDuringExecution:
                                    nodeSelectorTerms:
                                      - matchExpressions:
                                          - key: node-role.kubernetes.io/control-plane
                                            operator: Exists
                              serviceAccount: cilium-install
                              serviceAccountName: cilium-install
                              hostNetwork: true
                              containers:
                                - name: cilium-install
                                  image: alpine/helm:3.12.3
                                  env:
                                    - name: KUBERNETES_SERVICE_HOST
                                      valueFrom:
                                        fieldRef:
                                          apiVersion: v1
                                          fieldPath: status.podIP
                                    - name: KUBERNETES_SERVICE_PORT
                                      value: "6443"
                                  command:
                                    - /bin/sh
                                    - -c
                                    - |
                                      helm upgrade --install cilium oci://ghcr.io/nicklasfrahm/charts/cilium \
                                        --namespace kube-system \
                                        --set cilium.operator.replicas=1
                
                machine:
                  nodeLabels:
                    # Allow cilium to use the node's IP address for external load balancers.
                    node.kubernetes.io/exclude-from-external-load-balancers:
                      "$patch": "delete"
            EOT,
          + <<-EOT
                "machine":
                  "network":
                    "hostname": "antelope.nicklasfrahm.dev"
            EOT,
        ]
      + id                    = (known after apply)
      + kubernetes_version    = "v1.30.11"
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "controlplane"
      + talos_version         = "v1.9.5"
    }

  # module.talos_cluster["hel01"].talos_cluster_kubeconfig.this will be updated in-place
  ~ resource "talos_cluster_kubeconfig" "this" {
      ~ client_configuration            = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBdkRzWkMxMnE5ZmFHU2R4SUY3Y0lNekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNek13TVRZeU9EQTFXaGNOTXpVd016STRNVFl5T0RBMVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQVBTdFZiM3JXVnhRcEpHZURLOExGdmxjZEJkS01HcTJ3cjZmCkYvQ0xGcCt5bzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkpReTZvZzRQTlh6QngrRQorYWVRNTNNekxadWlNQVVHQXl0bGNBTkJBTHZqaDZHcU5iQzlMTWlGR1RiL09obmVtMUtDaHl1RmdNQ1gxQ3VCCm1mK1FhY2crUVZ6YVh1RW8xSkw1YjBSaWVPbjJnLzR4Q3psQ0NjMDNpQXp4Q2dvPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEFrSjlHVUtDWTE1a1R1ZzBkZnZnTHVNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXpNekF4TmpJNE1EVmFGdzB5TmpBek16QXhOakk0TURWYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQVA2ODJzMlBmNXM1aVFDTzBmU1BDM2JzdWpiV242NzZPCkVlZ1pQNTNveHF5alNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1VNdXFJT0R6Vjh3Y2ZoUG1ua09kek15MmJvakFGQmdNclpYQURRUURaN2dYMQpMNmlJUXNPZXB4MzE3MVdYenhXb0srMVd2Zy9qTkFFYyt5bEROcEtMSEpncGFQMEdXTDcxQkl3NStqdlJBdWdGCkpWWW5uVXljdyt6NW1OWUIKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ client_key         = (sensitive value)
        } -> (known after apply)
        id                              = "lab01"
        # (5 unchanged attributes hidden)
    }

  # module.talos_cluster["hel01"].talos_machine_bootstrap.controlplane["antelope.nicklasfrahm.dev"] will be updated in-place
  ~ resource "talos_machine_bootstrap" "controlplane" {
      ~ client_configuration = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBdkRzWkMxMnE5ZmFHU2R4SUY3Y0lNekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNek13TVRZeU9EQTFXaGNOTXpVd016STRNVFl5T0RBMVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQVBTdFZiM3JXVnhRcEpHZURLOExGdmxjZEJkS01HcTJ3cjZmCkYvQ0xGcCt5bzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkpReTZvZzRQTlh6QngrRQorYWVRNTNNekxadWlNQVVHQXl0bGNBTkJBTHZqaDZHcU5iQzlMTWlGR1RiL09obmVtMUtDaHl1RmdNQ1gxQ3VCCm1mK1FhY2crUVZ6YVh1RW8xSkw1YjBSaWVPbjJnLzR4Q3psQ0NjMDNpQXp4Q2dvPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEFrSjlHVUtDWTE1a1R1ZzBkZnZnTHVNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXpNekF4TmpJNE1EVmFGdzB5TmpBek16QXhOakk0TURWYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQVA2ODJzMlBmNXM1aVFDTzBmU1BDM2JzdWpiV242NzZPCkVlZ1pQNTNveHF5alNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1VNdXFJT0R6Vjh3Y2ZoUG1ua09kek15MmJvakFGQmdNclpYQURRUURaN2dYMQpMNmlJUXNPZXB4MzE3MVdYenhXb0srMVd2Zy9qTkFFYyt5bEROcEtMSEpncGFQMEdXTDcxQkl3NStqdlJBdWdGCkpWWW5uVXljdyt6NW1OWUIKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ client_key         = (sensitive value)
        } -> (known after apply)
        id                   = "machine_bootstrap"
        # (2 unchanged attributes hidden)
    }

  # module.talos_cluster["hel01"].talos_machine_configuration_apply.controlplane["antelope.nicklasfrahm.dev"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "controlplane" {
      ~ client_configuration        = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBdkRzWkMxMnE5ZmFHU2R4SUY3Y0lNekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNek13TVRZeU9EQTFXaGNOTXpVd016STRNVFl5T0RBMVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQVBTdFZiM3JXVnhRcEpHZURLOExGdmxjZEJkS01HcTJ3cjZmCkYvQ0xGcCt5bzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkpReTZvZzRQTlh6QngrRQorYWVRNTNNekxadWlNQVVHQXl0bGNBTkJBTHZqaDZHcU5iQzlMTWlGR1RiL09obmVtMUtDaHl1RmdNQ1gxQ3VCCm1mK1FhY2crUVZ6YVh1RW8xSkw1YjBSaWVPbjJnLzR4Q3psQ0NjMDNpQXp4Q2dvPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEFrSjlHVUtDWTE1a1R1ZzBkZnZnTHVNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXpNekF4TmpJNE1EVmFGdzB5TmpBek16QXhOakk0TURWYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQVA2ODJzMlBmNXM1aVFDTzBmU1BDM2JzdWpiV242NzZPCkVlZ1pQNTNveHF5alNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1VNdXFJT0R6Vjh3Y2ZoUG1ua09kek15MmJvakFGQmdNclpYQURRUURaN2dYMQpMNmlJUXNPZXB4MzE3MVdYenhXb0srMVd2Zy9qTkFFYyt5bEROcEtMSEpncGFQMEdXTDcxQkl3NStqdlJBdWdGCkpWWW5uVXljdyt6NW1OWUIKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ client_key         = (sensitive value)
        } -> (known after apply)
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.talos_cluster["hel01"].talos_machine_secrets.secret_bundle will be updated in-place
  ~ resource "talos_machine_secrets" "secret_bundle" {
      ~ client_configuration = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBdkRzWkMxMnE5ZmFHU2R4SUY3Y0lNekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNek13TVRZeU9EQTFXaGNOTXpVd016STRNVFl5T0RBMVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQVBTdFZiM3JXVnhRcEpHZURLOExGdmxjZEJkS01HcTJ3cjZmCkYvQ0xGcCt5bzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkpReTZvZzRQTlh6QngrRQorYWVRNTNNekxadWlNQVVHQXl0bGNBTkJBTHZqaDZHcU5iQzlMTWlGR1RiL09obmVtMUtDaHl1RmdNQ1gxQ3VCCm1mK1FhY2crUVZ6YVh1RW8xSkw1YjBSaWVPbjJnLzR4Q3psQ0NjMDNpQXp4Q2dvPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEFrSjlHVUtDWTE1a1R1ZzBkZnZnTHVNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXpNekF4TmpJNE1EVmFGdzB5TmpBek16QXhOakk0TURWYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQVA2ODJzMlBmNXM1aVFDTzBmU1BDM2JzdWpiV242NzZPCkVlZ1pQNTNveHF5alNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1VNdXFJT0R6Vjh3Y2ZoUG1ua09kek15MmJvakFGQmdNclpYQURRUURaN2dYMQpMNmlJUXNPZXB4MzE3MVdYenhXb0srMVd2Zy9qTkFFYyt5bEROcEtMSEpncGFQMEdXTDcxQkl3NStqdlJBdWdGCkpWWW5uVXljdyt6NW1OWUIKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ client_key         = (sensitive value)
        } -> (known after apply)
        id                   = "machine_secrets"
      ~ machine_secrets      = {
          ~ certs      = {
              ~ etcd               = {
                  ~ cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJmVENDQVNPZ0F3SUJBZ0lRQi9TbkZSZjBXbWxqbWRSS0s0YmdpVEFLQmdncWhrak9QUVFEQWpBUE1RMHcKQ3dZRFZRUUtFd1JsZEdOa01CNFhEVEkxTURNek1ERTJNamd3TlZvWERUTTFNRE15T0RFMk1qZ3dOVm93RHpFTgpNQXNHQTFVRUNoTUVaWFJqWkRCWk1CTUdCeXFHU000OUFnRUdDQ3FHU000OUF3RUhBMElBQkJ3VWJrbTg3Q3NpCnY0UjkyQ2Z1YTVmUEJSSWxRaVNGUSswTUZZT3oyK0JmM00vWkFjdlBXTTA4QWtsWkFFK01PUkoySW5jUEczUDQKaitaTjA1djYvUkNqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjRApBUVlJS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVWEFJMFYzdWRMNGlUCmh3amNCTXVxT09aUGZjb3dDZ1lJS29aSXpqMEVBd0lEU0FBd1JRSWhBTzBHMHlnelM1Ynk0alJQTE5pRjFLV24KdlVFbEV5Ky8wY3lWNzNjdFdUVW9BaUFKM3hsWS9CWGE2V2JUQkxSS2NXMEhwa0V5cU1aSVBxVURCT2Z4YzQyawpNUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
                  # Warning: this attribute value will no longer be marked as sensitive
                  # after applying this change.
                  ~ key  = (sensitive value)
                } -> (known after apply)
              ~ k8s                = {
                  ~ cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJpVENDQVRDZ0F3SUJBZ0lSQUtRZlhJZE9UMVBIaXpjYjFvQURxNkV3Q2dZSUtvWkl6ajBFQXdJd0ZURVQKTUJFR0ExVUVDaE1LYTNWaVpYSnVaWFJsY3pBZUZ3MHlOVEF6TXpBeE5qSTRNRFZhRncwek5UQXpNamd4TmpJNApNRFZhTUJVeEV6QVJCZ05WQkFvVENtdDFZbVZ5Ym1WMFpYTXdXVEFUQmdjcWhrak9QUUlCQmdncWhrak9QUU1CCkJ3TkNBQVJ5MDlGblZraGVpcUdLcnppY0pFZ2V5Tzk3UklmUnN4U0dsMjhjTG1mOUdheFpYQXRvUVdyQ2FTSS8KVG1kUmo4WW91Nzlkb21MdDlRMkh0aGU4RlRxU28yRXdYekFPQmdOVkhROEJBZjhFQkFNQ0FvUXdIUVlEVlIwbApCQll3RkFZSUt3WUJCUVVIQXdFR0NDc0dBUVVGQndNQ01BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0hRWURWUjBPCkJCWUVGRjI0SCtobmROQkR6bGxJWlB5aUM4Nm14SGxMTUFvR0NDcUdTTTQ5QkFNQ0EwY0FNRVFDSUZRRzdmdEsKYzlCZkVBN2o2ajlkcVNCc09CRmZHMFE1SXdlQWhISWh5RGtMQWlCcXdGK0VLc3F0SmEzTzRJa0FGT2d2dVlBKwphTDhiTmU2SUF3bFZZN3Z6Ymc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
                  # Warning: this attribute value will no longer be marked as sensitive
                  # after applying this change.
                  ~ key  = (sensitive value)
                } -> (known after apply)
              ~ k8s_aggregator     = {
                  ~ cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJYekNDQVFXZ0F3SUJBZ0lRWVI3R0Y0K0dyWXowdXkrRmFwUHhDakFLQmdncWhrak9QUVFEQWpBQU1CNFgKRFRJMU1ETXpNREUyTWpnd05Wb1hEVE0xTURNeU9ERTJNamd3TlZvd0FEQlpNQk1HQnlxR1NNNDlBZ0VHQ0NxRwpTTTQ5QXdFSEEwSUFCQ09hV0lsNmZDR0kvMS9TWi9yNzNqQ0g0aTZKZGRUR2E0MXhUYUowaU9FR3dMeWZyNzFECkxvdjQraDFnVDRrVUhFQmVhSkNzRERzdVB4SFI1WDBNa251allUQmZNQTRHQTFVZER3RUIvd1FFQXdJQ2hEQWQKQmdOVkhTVUVGakFVQmdnckJnRUZCUWNEQVFZSUt3WUJCUVVIQXdJd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBZApCZ05WSFE0RUZnUVV3WjBtM1BTZzBkdGFSTzJtZ0dseHdFeHlqc1l3Q2dZSUtvWkl6ajBFQXdJRFNBQXdSUUloCkFMa1NsMkdzNlFWTTZ6RFRiVTNQVkVZZXUyV2RKL3d1bitKVC9mcW1EVHBiQWlCMHRpb1FlVnhCYW4rcTVVUDMKYk5DUWw5Ujltdm1WYnJ0dC8xeU43N1VoVnc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
                  # Warning: this attribute value will no longer be marked as sensitive
                  # after applying this change.
                  ~ key  = (sensitive value)
                } -> (known after apply)
              ~ k8s_serviceaccount = {
                  # Warning: this attribute value will no longer be marked as sensitive
                  # after applying this change.
                  ~ key = (sensitive value)
                } -> (known after apply)
              ~ os                 = {
                  ~ cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBdkRzWkMxMnE5ZmFHU2R4SUY3Y0lNekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNek13TVRZeU9EQTFXaGNOTXpVd016STRNVFl5T0RBMVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQVBTdFZiM3JXVnhRcEpHZURLOExGdmxjZEJkS01HcTJ3cjZmCkYvQ0xGcCt5bzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkpReTZvZzRQTlh6QngrRQorYWVRNTNNekxadWlNQVVHQXl0bGNBTkJBTHZqaDZHcU5iQzlMTWlGR1RiL09obmVtMUtDaHl1RmdNQ1gxQ3VCCm1mK1FhY2crUVZ6YVh1RW8xSkw1YjBSaWVPbjJnLzR4Q3psQ0NjMDNpQXp4Q2dvPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
                  # Warning: this attribute value will no longer be marked as sensitive
                  # after applying this change.
                  ~ key  = (sensitive value)
                } -> (known after apply)
            } -> (known after apply)
          ~ cluster    = {
              ~ id     = "ggha-uk8cJi6e7VXCL1SNGXR5gISCbrG7JLdVGkNoWk=" -> (known after apply)
              # Warning: this attribute value will no longer be marked as sensitive
              # after applying this change.
              ~ secret = (sensitive value)
            } -> (known after apply)
          ~ secrets    = {
              + aescbc_encryption_secret    = (sensitive value)
              # Warning: this attribute value will no longer be marked as sensitive
              # after applying this change.
              ~ bootstrap_token             = (sensitive value)
              # Warning: this attribute value will no longer be marked as sensitive
              # after applying this change.
              ~ secretbox_encryption_secret = (sensitive value)
            } -> (known after apply)
          ~ trustdinfo = {
              # Warning: this attribute value will no longer be marked as sensitive
              # after applying this change.
              ~ token = (sensitive value)
            } -> (known after apply)
        } -> (known after apply)
      ~ talos_version        = "v1.9.3" -> "v1.9.5"
    }

Plan: 0 to add, 4 to change, 0 to destroy.

Changes to Outputs:
  ~ talosconfigs = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: opentofu.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "opentofu.tfplan"
```

</details>